import { Wrap, Text } from "./AboutPage.styled";
export const AboutPage = () => {

  return (
    <>
      <Wrap>
        <h3>Пояснення про виконання завдання.</h3>
        <Text>
          Виконано рефакторинг коду програми «Книга контактів». Видалено код, що відповідає за зберігання та читання контактів з локального сховища, та додано взаємодію з бекендом для зберігання контактів. <br />
          Створено персональний бекенд для розробки за допомогою UI-сервісу mockapi.io. Створено ресурс "contacts" щоб отримати endpoint - "/contacts". За допомогою конструктора ресурсу створено об'єкт контакту згідно технічного завдання.  <br />
          Додано у стан Redux обробку індикатора завантаження та помилки. Для цього було зміниено форму стану.<br />
          Використано функцію createAsyncThunk для оголошення асинхронних генераторів екшенів та виконання HTTP-запитів. Обробку екшенів та зміну даних у стані Redux виконано за допомогою createSlice.
          Оголосено наступні операції:<br />
          fetchContacts - одержання масиву контактів (метод GET) запитом. Базовий тип екшену "contacts/fetchAll".<br />
          addContact - додавання контакту (метод POST). Базовий тип екшену "contacts/addContact".<br />
          deleteContact - видалення контакту (метод DELETE). Базовий тип екшену "contacts/deleteContact".
        </Text>
      </Wrap>
    </>
  )
}